khoih-prog/ESP_AT_WM_Lite/src/Esp8266_AT_WM_Lite_RPi_Pico.h
      uint16_t offset = 0;
           
      for (uint8_t i = 0; i < NUM_MENU_ITEMS; i++)
      {       
        uint8_t * _pointer = (uint8_t *) readBuffer;

        // Actual size of pdata is [maxlen + 1]
        memset(readBuffer, 0, myMenuItems[i].maxlen + 1);
        
        // Redundant, but to be sure correct position
        file.seek(offset);
        file.read(_pointer, myMenuItems[i].maxlen);
        
        offset += myMenuItems[i].maxlen;
     
        ESP_AT_LOGDEBUG3(F("ChkCrR:pdata="), readBuffer, F(",len="), myMenuItems[i].maxlen);         
               
        for (uint16_t j = 0; j < myMenuItems[i].maxlen; j++,_pointer++)
        {         
          checkSum += *_pointer;  
        }       
      }

      file.read((uint8_t *) &readCheckSum, sizeof(readCheckSum));
      
      ESP_AT_LOGDEBUG(F("OK"));
      file.close();
      
      totalDataSize = sizeof(ESP8266_AT_config) + sizeof(readCheckSum) + offset;
      
      ESP_AT_LOGDEBUG3(F("CrCCsum=0x"), String(checkSum, HEX), F(",CrRCsum=0x"), String(readCheckSum, HEX));
      
      // Free buffer
      if (readBuffer != NULL)
      {
        free(readBuffer);
        ESP_AT_LOGDEBUG(F("Buffer freed"));
      }
      
      if ( checkSum != readCheckSum)
      {
        return false;
      }
      
      return true;    
    }
    
    //////////////////////////////////////////////

    bool loadDynamicData()
    {
      int checkSum = 0;
      int readCheckSum;
      
      // file existed
      File file = FileFS.open(CREDENTIALS_FILENAME, "r");
      
      ESP_AT_LOGDEBUG(F("LoadCredFile "));

      if (!file)
      {
        ESP_AT_LOGDEBUG(F("failed"));

        // Trying open redundant config file
         file = FileFS.open(CREDENTIALS_FILENAME_BACKUP, "r");
        
        ESP_AT_LOGDEBUG(F("LoadBkUpCredFile "));

        if (!file)
        {
          ESP_AT_LOGDEBUG(F("failed"));
          return false;
        }
      }
     
      uint16_t offset = 0;
      
      for (uint8_t i = 0; i < NUM_MENU_ITEMS; i++)
      {       
        char* _pointer = myMenuItems[i].pdata;

        // Actual size of pdata is [maxlen + 1]
        memset(myMenuItems[i].pdata, 0, myMenuItems[i].maxlen + 1);
        
        // Redundant, but to be sure correct position
        file.seek(offset);
        file.read((uint8_t *) _pointer, myMenuItems[i].maxlen);
        
        offset += myMenuItems[i].maxlen;        
    
        ESP_AT_LOGDEBUG3(F("CrR:pdata="), myMenuItems[i].pdata, F(",len="), myMenuItems[i].maxlen);         
               
        for (uint16_t j = 0; j < myMenuItems[i].maxlen; j++,_pointer++)
        {         
          checkSum += *_pointer;  
        }       
      }

      file.read((uint8_t *) &readCheckSum, sizeof(readCheckSum));
      
      totalDataSize = sizeof(ESP8266_AT_config) + sizeof(readCheckSum) + offset;
      
      ESP_AT_LOGDEBUG(F("OK"));
      file.close();
      
      ESP_AT_LOGDEBUG3(F("CrCCsum=0x"), String(checkSum, HEX), F(",CrRCsum=0x"), String(readCheckSum, HEX));
      
      if ( checkSum != readCheckSum)
      {
        return false;
      }
      
      return true;    
    }
    
    //////////////////////////////////////////////

    void saveDynamicData()
    {
      int checkSum = 0;
    
      // file existed
      File file = FileFS.open(CREDENTIALS_FILENAME, "w");
      
      ESP_AT_LOGDEBUG(F("SaveCredFile "));

      uint16_t offset = 0;
      
      for (uint8_t i = 0; i < NUM_MENU_ITEMS; i++)
      {       
        char* _pointer = myMenuItems[i].pdata;
       
        ESP_AT_LOGDEBUG3(F("CW1:pdata="), myMenuItems[i].pdata, F(",len="), myMenuItems[i].maxlen);
        
        if (file)
        {
          // Redundant, but to be sure correct position
          file.seek(offset);                   
          file.write((uint8_t*) _pointer, myMenuItems[i].maxlen); 
          
          offset += myMenuItems[i].maxlen;      
        }
        else
        {
          ESP_AT_LOGDEBUG(F("failed"));
        }        
                     
        for (uint16_t j = 0; j < myMenuItems[i].maxlen; j++,_pointer++)
        {         
          checkSum += *_pointer;     
         }
      }
      
      if (file)
      {
        file.write((uint8_t*) &checkSum, sizeof(checkSum));     
        file.close();
        ESP_AT_LOGDEBUG(F("OK"));    
      }
      else
      {
        ESP_AT_LOGDEBUG(F("failed"));
      }   
           
      ESP_AT_LOGDEBUG1(F("CrWCSum=0x"), String(checkSum, HEX));
      
      // Trying open redundant Auth file
      file = FileFS.open(CREDENTIALS_FILENAME_BACKUP, "w");
      
      ESP_AT_LOGDEBUG(F("SaveBkUpCredFile "));

      offset = 0;
      
      for (uint8_t i = 0; i < NUM_MENU_ITEMS; i++)
      {       
        char* _pointer = myMenuItems[i].pdata;
     
        ESP_AT_LOGDEBUG3(F("CW2:pdata="), myMenuItems[i].pdata, F(",len="), myMenuItems[i].maxlen);
        
        if (file)
        {
          file.seek(offset);                   
          file.write((uint8_t*) _pointer, myMenuItems[i].maxlen); 
          
          // Redundant, but to be sure correct position
          offset += myMenuItems[i].maxlen; 
        }
        else
        {
          ESP_AT_LOGDEBUG(F("failed"));
        }        
                     
        for (uint16_t j = 0; j < myMenuItems[i].maxlen; j++,_pointer++)
        {         
          checkSum += *_pointer;     
         }
      }
      
      if (file)
      {
        file.write((uint8_t*) &checkSum, sizeof(checkSum));     
        file.close();
        ESP_AT_LOGDEBUG(F("OK"));    
      }
      else
      {
        ESP_AT_LOGDEBUG(F("failed"));
      }   
    }

#endif

    //////////////////////////////////////////////
 
    void NULLTerminateConfig()
    {
      //#define HEADER_MAX_LEN      16
      //#define BOARD_NAME_MAX_LEN  24
      
      // NULL Terminating to be sure
      ESP8266_AT_config.header    [HEADER_MAX_LEN - 1]      = 0;
      ESP8266_AT_config.board_name[BOARD_NAME_MAX_LEN - 1]  = 0;
      
      // For WiFi SSID/PWD here
      for (uint8_t i = 0; i < NUM_WIFI_CREDENTIALS; i++)
      {
        ESP8266_AT_config.WiFi_Creds[i].wifi_ssid[SSID_MAX_LEN - 1] = 0;
        ESP8266_AT_config.WiFi_Creds[i].wifi_pw  [PASS_MAX_LEN - 1] = 0;
      }
    }
    
    //////////////////////////////////////////////  
    
