khoih-prog/ESP_AT_WM_Lite/src/Esp8266_AT_WM_Lite_RPi_Pico.h
    bool isWiFiConfigValid()
    {
      #if REQUIRE_ONE_SET_SSID_PW
      // If SSID ="blank" or NULL, or PWD length < 8 (as required by standard) => return false
      // Only need 1 set of valid SSID/PWD
      if (!( ( ( strncmp(ESP8266_AT_config.WiFi_Creds[0].wifi_ssid, WM_NO_CONFIG, strlen(WM_NO_CONFIG)) && 
                 strlen(ESP8266_AT_config.WiFi_Creds[0].wifi_ssid) >  0 )  &&
             (   strlen(ESP8266_AT_config.WiFi_Creds[0].wifi_pw) >= PASSWORD_MIN_LEN ) ) ||
             ( ( strncmp(ESP8266_AT_config.WiFi_Creds[1].wifi_ssid, WM_NO_CONFIG, strlen(WM_NO_CONFIG)) && 
                 strlen(ESP8266_AT_config.WiFi_Creds[1].wifi_ssid) >  0 )  &&
               ( strlen(ESP8266_AT_config.WiFi_Creds[1].wifi_pw) >= PASSWORD_MIN_LEN ) ) ))
      #else
      // If SSID ="blank" or NULL, or PWD length < 8 (as required by standard) => invalid set
      // Need both sets of valid SSID/PWD
      if ( !strncmp(ESP8266_AT_config.WiFi_Creds[0].wifi_ssid,   WM_NO_CONFIG, strlen(WM_NO_CONFIG) )  ||
           !strncmp(ESP8266_AT_config.WiFi_Creds[0].wifi_pw,     WM_NO_CONFIG, strlen(WM_NO_CONFIG) )  ||
           !strncmp(ESP8266_AT_config.WiFi_Creds[1].wifi_ssid,   WM_NO_CONFIG, strlen(WM_NO_CONFIG) )  ||
           !strncmp(ESP8266_AT_config.WiFi_Creds[1].wifi_pw,     WM_NO_CONFIG, strlen(WM_NO_CONFIG) )  ||
           ( strlen(ESP8266_AT_config.WiFi_Creds[0].wifi_ssid) == 0 ) || 
           ( strlen(ESP8266_AT_config.WiFi_Creds[1].wifi_ssid) == 0 ) ||
           ( strlen(ESP8266_AT_config.WiFi_Creds[0].wifi_pw)   < PASSWORD_MIN_LEN ) ||
           ( strlen(ESP8266_AT_config.WiFi_Creds[1].wifi_pw)   < PASSWORD_MIN_LEN ) )
      #endif     
      {
        ESP_AT_LOGERROR(F("Invalid Stored WiFi Config Data."));
        
        // Nullify the invalid data to avoid displaying garbage
        memset(&ESP8266_AT_config, 0, sizeof(ESP8266_AT_config));
        
        // If SSID, PW ="blank" or NULL, or PPWD len < 8, set the flag      
        if ( ( strlen(ESP8266_AT_config.WiFi_Creds[0].wifi_pw) < PASSWORD_MIN_LEN ) ||
             ( strlen(ESP8266_AT_config.WiFi_Creds[1].wifi_pw) < PASSWORD_MIN_LEN ) )
        {    
          ESP_AT_LOGERROR(F("WiFi PWD len < 8"));
        }
        else
        {
          ESP_AT_LOGERROR(F("SSID is blank or NULL"));
        }
        
        hadConfigData = false;
        
        return false;
      }
      
      return true;
    }
                
    //////////////////////////////////////////////

    bool loadConfigData()
    {
      ESP_AT_LOGWARN(F("LoadCfgFile "));
      
      // file existed
      File file = FileFS.open(CONFIG_FILENAME, "r");
         
      if (!file)
      {
        ESP_AT_LOGWARN(F("failed"));

        // Trying open redundant config file
        file = FileFS.open(CONFIG_FILENAME_BACKUP, "r");
        ESP_AT_LOGWARN(F("LoadBkUpCfgFile "));

        if (!file)
        {
          ESP_AT_LOGWARN(F("failed"));
          return false;
        }
      }
     
      file.seek(0);
      file.read((uint8_t *) &ESP8266_AT_config, sizeof(ESP8266_AT_config));

      ESP_AT_LOGWARN(F("OK"));
      file.close();
      
      NULLTerminateConfig();
      
      return isWiFiConfigValid();
    }
    
    //////////////////////////////////////////////

    void saveConfigData()
    {
      ESP_AT_LOGWARN(F("SaveCfgFile "));

      int calChecksum = calcChecksum();
      ESP8266_AT_config.checkSum = calChecksum;
      ESP_AT_LOGWARN1(F("WCSum=0x"), String(calChecksum, HEX));
      
      // file existed
      File file = FileFS.open(CONFIG_FILENAME, "w");

      if (file)
      {
        file.seek(0);
        file.write((uint8_t*) &ESP8266_AT_config, sizeof(ESP8266_AT_config));
        
        file.close();
        ESP_AT_LOGWARN(F("OK"));
      }
      else
      {
        ESP_AT_LOGWARN(F("failed"));
      }
      
      ESP_AT_LOGWARN(F("SaveBkUpCfgFile "));
      
      // Trying open redundant Auth file
      file = FileFS.open(CONFIG_FILENAME_BACKUP, "w");

      if (file)
      {
        file.seek(0);
        file.write((uint8_t *) &ESP8266_AT_config, sizeof(ESP8266_AT_config));
        
        file.close();
        ESP_AT_LOGWARN(F("OK"));
      }
      else
      {
        ESP_AT_LOGWARN(F("failed"));
      }
      
#if USE_DYNAMIC_PARAMETERS      
      saveDynamicData();
#endif
    }
    
    //////////////////////////////////////////////
    // New from v1.0.4
    void loadAndSaveDefaultConfigData()
    {
      // Load Default Config Data from Sketch
      memcpy(&ESP8266_AT_config, &defaultConfig, sizeof(ESP8266_AT_config));
      strcpy(ESP8266_AT_config.header, ESP_AT_BOARD_TYPE);
      
      // Including config and dynamic data, and assume valid
      saveConfigData();
          
      ESP_AT_LOGWARN(F("======= Start Loaded Config Data ======="));
      displayConfigData(ESP8266_AT_config);    
    }
    
    //////////////////////////////////////////////
    
    // Return false if init new EEPROM or SPIFFS. No more need trying to connect. Go directly to config mode
    bool getConfigData()
    {
      bool dynamicDataValid = true;  
      int calChecksum; 
      
      hadConfigData = false;
      
      // Initialize Internal File System
      if (!FileFS.begin())
      {
        ESP_AT_LOGERROR(F("LittleFS failed"));
        return false;
      }

      // Use new LOAD_DEFAULT_CONFIG_DATA logic
      if (LOAD_DEFAULT_CONFIG_DATA)
      {     
        // Load Config Data from Sketch
        loadAndSaveDefaultConfigData();
        
        // Don't need Config Portal anymore
        return true; 
      }
      else
      {   
        // Load stored config data from LittleFS
        // If WiFi SSID/PWD "blank" or NULL, or PWD len < 8, set false flag and exit
        if (!loadConfigData())
        {
          return false;
        }
        
        calChecksum = calcChecksum();

        ESP_AT_LOGWARN3(F("CCSum=0x"), String(calChecksum, HEX), F(",RCSum=0x"), String(ESP8266_AT_config.checkSum, HEX));
        
#if USE_DYNAMIC_PARAMETERS        
        // Load stored dynamic data from LittleFS
        dynamicDataValid = checkDynamicData();
#endif
        
